OpenFOAM/OpenFOAM-2.2.x/tutorials/DNS/dnsFoam/boxTurb16/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=`getApplication`

runApplication blockMesh
runApplication boxTurb
runApplication $application
runApplication enstrophy

# ----------------------------------------------------------------- end-of-file
